---
kind: property
id: P:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileType
source: html/34bd82bc-f067-f9f9-6aea-e5fc8990dbe7.htm
---
# Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileType Property

The id of the profile family applied to boundaries between parts.

## Syntax (C#)
```csharp
public ElementId ProfileType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null